package com.suixin.tm4t.L1HelloJava.接口;

/**
 * @Description: 接口
 * @Date:2019/6/4 10:12
 * @Auther:acheng
 **/
public interface 接口概述 {
    /**
     * 在JAVA编程语言中是一个抽象类型，是抽象方法的集合，接口通常以interface来声明。一个类通过继承接口的方式，从而来继承接口的抽象方法。
     *
     * 接口并不是类，编写接口的方式和类很相似，但是它们属于不同的概念。类描述对象的属性和方法。接口则包含类要实现的方法。
     *
     * 除非实现接口的类是抽象类，否则该类要定义接口中的所有方法。
     *
     * 接口无法被实例化，但是可以被实现。一个实现接口的类，必须实现接口内所描述的所有方法，否则就必须声明为抽象类。
     * 另外，在 Java 中，接口类型可用来声明一个变量，他们可以成为一个空指针，或是被绑定在一个以此接口实现的对象。
     *
     * 定义一个接口的格式如下
     * [修饰符] interface 接口名 [extends 父接口名列表]{
     * [public] [static] [final] 常量;
     * [public] [abstract] 方法;
     * }
     *
     * []中括号表明可选,也表明了如果有则唯一.可以理解成不写则为默认
     */
 }

